#ifndef __Aphorism__
#define __Aphorism__

//-------------------------------------------------------------------------------------
// Aphorism.h - содержит описание альтернативы "Афоризм" и её интерфейса
//-------------------------------------------------------------------------------------

#include <stdio.h>
#include "random.h"

//Афоризм
struct Aphorism {
	char* author; // автор афоризма
};

// Ввод параметров афоризма из файла
void In(Aphorism& с, FILE* file);

// Случайный ввод афоризма
void InRnd(Aphorism& с);

#endif //__Aphorism__
