#ifndef __Saying__
#define __Saying__

//-------------------------------------------------------------------------------------
// Saying.h - содержит описание альтернативы "Пословицы и поговороки" и её интерфейса
//-------------------------------------------------------------------------------------

#include <stdio.h>
#include "random.h"

// Пословицы и поговорки
struct Saying {
	char* country; // страна
};

// Ввод параметров пословицы/поговорки из файла
void In(Saying& с, FILE* file);

// Случайный ввод пословицы/поговорки
void InRnd(Saying& с);

#endif //__Saying__
